Revit 2024 API
PipePressureDropData.VelocityPressure Property
 The velocity pressure of the pipe. Units: (kg/(ft·s²))
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double VelocityPressure { get; set; }
Visual Basic
Public Property VelocityPressure As Double
	Get
	Set
Visual C++
public:
property double VelocityPressure {
	double get ();
	void set (double value);
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace